// const arr1 = [1, 2, 3, 4];
// const arr2 = [1, 4, 2];     //3

// arr1.sort();
// arr2.sort();

// for (let i = 0; i < arr1.length; i++) {

//     const a = arr1[i]
//     console.log('arr 1 =', a);
//     for (let j = 0; j < arr2.length; j++) { 
        
//         //  1=1   1<3 4

//         const b = arr2[j];
//         console.log('arr 2 =', b);
//     }
// }





//23 функция принимает два числа n, m (например n= 10, m = 5)
// и получает строку рисующую прямоугольник n*m
// a) закрашенный:
// **********
// **********
// **********
// **********
// **********

let str = '';

for (let index = 0; index < 5; index++) {
  for (let index = 0; index < 10; index++) {
    str += '*';
     
  }
}








// ------------------------------------------------
//24 b) незакрашенный:
// **********
// *        *
// *        *
// *        *
// **********